app/controllers/sessions_controller.rb

	def create
		user = User.find_by_email(session_params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "iaramirez@miuandes.cl"], ["LIMIT", 1]]